#include <string.h>
#include <stdlib.h>
#include <stdio.h>
#include <stdarg.h>
#include <unistd.h>
#include <sys/socket.h>
#include <sys/un.h>
#include <poll.h>
#include <errno.h>
#include <stdint.h>
#include <stddef.h>

static void stub_log(const char* fmt, ...) {
    char buf[256];
    va_list ap;
    va_start(ap, fmt);
    int n = vsnprintf(buf, sizeof(buf), fmt, ap);
    va_end(ap);
    if (n > 0) write(STDERR_FILENO, buf, (size_t)n);
}
typedef unsigned long XID;
typedef XID Window;
typedef XID Drawable;
typedef XID Colormap;
typedef XID Cursor;
typedef XID Pixmap;
typedef XID Atom;
typedef XID Font;
typedef XID KeySym;
typedef unsigned char KeyCode;
typedef unsigned long Time;
typedef unsigned long VisualID;
typedef int Bool;
typedef int Status;
#define True 1
#define False 0
#define None 0L
#define Success 0
#define TrueColor 4
#define InputOutput 1
#define AllocNone 0

typedef void* GC;
typedef void* XIM;
typedef void* XIC;
typedef void* XFontSet;
typedef void* XPointer;

typedef struct _XDisplay Display;
typedef int (*XErrorHandler)(Display*, void*);
typedef int (*XIOErrorHandler)(Display*);

struct Visual {
    void* ext_data;
    VisualID visualid;
    int c_class;
    unsigned long red_mask;
    unsigned long green_mask;
    unsigned long blue_mask;
    int bits_per_rgb;
    int map_entries;
};

typedef struct {
    struct Visual *visual;
    VisualID visualid;
    int screen;
    int depth;
    int c_class;
    unsigned long red_mask;
    unsigned long green_mask;
    unsigned long blue_mask;
    int colormap_size;
    int bits_per_rgb;
} XVisualInfo;

typedef struct {
    unsigned char *value;
    Atom encoding;
    int format;
    unsigned long nitems;
} XTextProperty;

typedef struct {
    long flags;
    int x, y;
    int width, height;
    int min_width, min_height;
    int max_width, max_height;
    int width_inc, height_inc;
    struct { int x; int y; } min_aspect, max_aspect;
    int base_width, base_height;
    int win_gravity;
} XSizeHints;

typedef struct {
    long flags;
    int input;
    int initial_state;
    Pixmap icon_pixmap;
    Window icon_window;
    int icon_x, icon_y;
    Pixmap icon_mask;
    XID window_group;
} XWMHints;

typedef struct {
    char *res_name;
    char *res_class;
} XClassHint;

typedef struct {
    short lbearing, rbearing;
    short width;
    short ascent, descent;
    unsigned short attributes;
} XCharStruct;

typedef struct {
    void* ext_data;
    Font fid;
    unsigned direction;
    unsigned min_char_or_byte2, max_char_or_byte2;
    unsigned min_byte1, max_byte1;
    Bool all_chars_exist;
    unsigned default_char;
    int n_properties;
    void* properties;
    XCharStruct min_bounds, max_bounds;
    XCharStruct* per_char;
    int ascent, descent;
} XFontStruct;

typedef struct {
    int type;
    unsigned long serial;
    Bool send_event;
    Display *display;
    Window window;
    char pad[256];
} XEvent;

typedef XEvent XKeyEvent;
typedef XEvent XKeyPressedEvent;
typedef XEvent XMappingEvent;

typedef struct { int max_keypermod; KeyCode *modifiermap; } XModifierKeymap;

typedef struct {
    int x, y;
    int width, height;
    int border_width;
    int depth;
    struct Visual *visual;
    Window root;
    int c_class;
    int bit_gravity, win_gravity;
    int backing_store;
    unsigned long backing_planes, backing_pixel;
    Bool save_under;
    Colormap colormap;
    Bool map_installed;
    int map_state;
    long all_event_masks, your_event_mask, do_not_propagate_mask;
    Bool override_redirect;
    void *screen;
} XWindowAttributes;

typedef void* XComposeStatus;
typedef void* XSetWindowAttributes;
typedef void* XGCValues;
typedef void* XColor;

typedef struct { int count; int success; } XPixmapFormatValues;

typedef struct {
    void* ext_data;
    struct _XDisplay *display;
    Window root;
    int width, height;
    int mwidth, mheight;
    int ndepths;
    void* depths;
    int root_depth;
    struct Visual *root_visual;
    GC default_gc;
    Colormap cmap;
    unsigned long white_pixel, black_pixel;
    int max_maps, min_maps;
    int backing_store;
    Bool save_unders;
    long root_input_mask;
} Screen;

typedef struct _XImage {
    int width, height;
    int xoffset;
    int format;
    char *data;
    int byte_order;
    int bitmap_unit, bitmap_bit_order, bitmap_pad;
    int depth;
    int bytes_per_line;
    int bits_per_pixel;
    unsigned long red_mask, green_mask, blue_mask;
    XPointer obdata;
    struct funcs {
        void* create_image;
        int (*destroy_image)(struct _XImage*);
        unsigned long (*get_pixel)(struct _XImage*, int, int);
        int (*put_pixel)(struct _XImage*, int, int, unsigned long);
        void* sub_image;
        int (*add_pixel)(struct _XImage*, long);
    } f;
} XImage;

typedef void* xReply;
typedef void* xGenericReply;
typedef void* XGenericEventCookie;
typedef void* XkbStatePtr;
typedef void* XkbDescPtr;
typedef unsigned long BarrierEventID;
typedef unsigned long PointerBarrier;
typedef void* XrmHashBucketRec;
typedef int XICCEncodingStyle;
typedef struct { short x, y, width, height; } XRectangle;

static struct Visual s_visual = {
    .visualid = 0x21,
    .c_class = TrueColor,
    .red_mask = 0xFF0000,
    .green_mask = 0x00FF00,
    .blue_mask = 0x0000FF,
    .bits_per_rgb = 8,
    .map_entries = 256,
};

static Screen s_screen = {
    .width = 1280,
    .height = 1024,
    .mwidth = 338,
    .mheight = 270,
    .root_depth = 24,
    .root_visual = &s_visual,
    .root = 0x1,
    .cmap = 0x20,
    .white_pixel = 0xFFFFFF,
    .black_pixel = 0x000000,
};

// fake enough XDisplay values for SDL to get through
struct _XDisplay {
    void* ext_data;
    void* private1;            // 8
    int fd;                    // 16
    int private2;              // 20
    int proto_major_version;   // 24
    int proto_minor_version;   // 28
    char *vendor;              // 32
    XID private3;              // 40
    XID private4;              // 48
    XID private5;              // 56
    int private6;              // 64
    XID (*resource_alloc)(struct _XDisplay*); // 68
    int byte_order;            // 76
    int bitmap_unit;           // 80
    int bitmap_pad;            // 84
    int bitmap_bit_order;      // 88
    int nformats;              // 92
    void* pixmap_format;       // 96
    int private8;              // 104
    int release;               // 108
    void *private9, *private10;// 112, 120
    int qlen;                  // 128
    unsigned long last_request_read; // 132
    unsigned long request;     // 140
    XPointer private11;        // 148
    XPointer private12;        // 156
    XPointer private13;        // 164
    XPointer private14;        // 172
    unsigned max_request_size; // 180
    void *db;                  // 184
    int (*private15)(struct _XDisplay*); // 192
    char *display_name;        // 200
    int default_screen;        // 208
    int nscreens;              // 212
    Screen *screens;           // 216
};

static XID dummy_resource_alloc(struct _XDisplay *dpy) {
    static XID counter = 0x100;
    return ++counter;
}

static struct _XDisplay s_display = {
    .fd = 3,
    .proto_major_version = 11,
    .proto_minor_version = 0,
    .vendor = "PolyDroid",
    .byte_order = 0,
    .bitmap_unit = 32,
    .bitmap_pad = 32,
    .bitmap_bit_order = 0,
    .release = 12101000,
    .max_request_size = 65535,
    .display_name = ":0",
    .default_screen = 0,
    .nscreens = 1,
    .screens = &s_screen,
    .resource_alloc = dummy_resource_alloc,
};
static int s_display_initialized = 0;

static void ensure_display_init(void) {
    if (s_display_initialized) return;
    s_display_initialized = 1;
    s_screen.display = &s_display;
    stub_log("stubx11: display initialized (%dx%d)\n",
            s_screen.width, s_screen.height);
}

__attribute__((constructor))
static void init_from_env(void) {
    const char* w = getenv("POLYDROID_SCREEN_WIDTH");
